In [13]:
list = [['a','b','c'],['x','y','z']]

In [22]:
list[0][2]

'c'

In [23]:
list[1][1]

'y'

In [25]:
import numpy as np

In [28]:
x = np.array([[5,6,7],[9,10,11]])

In [29]:
x

array([[ 5,  6,  7],
       [ 9, 10, 11]])

In [32]:
#  ---- 
x[0][2]

7

In [33]:
x[0,2]

7

In [35]:
import pandas as pd

In [48]:
df = pd.read_csv('train.csv')

In [49]:
df.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969

In [61]:
df.loc[10:,"Product_ID":]

,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
10,P00251242,M,26-35,20,A,1,1,5,11.0,NaN,5254
11,P00014542,M,26-35,20,A,1,1,8,NaN,NaN,3957
12,P00031342,M,26-35,20,A,1,1,8,NaN,NaN,6073
13,P00145042,M,26-35,20,A,1,1,1,2.0,5.0,15665
14,P00231342,F,51-55,9,A,1,0,5,8.0,14.0,5378
...,...,...,...,...,...,...,...,...,...,...,...
550063,P00372445,M,51-55,13,B,1,1,20,NaN,NaN,368
550064,P00375436,F,26-35,1,C,3,0,20,NaN,NaN,371
550065,P00375436,F,26-35,15,B,4+,1,20,NaN,NaN,137
550066,P00375436,F,55+,1,C,2,0,20,NaN,NaN,365
550067,P00371644,F,46-50,0,B,4+,1,20,NaN,NaN,490

In [56]:
df.iloc[:5,:2]

   User_ID Product_ID
0  1000001  P00069042
1  1000001  P00248942
2  1000001  P00087842
3  1000001  P00085442
4  1000002  P00285442